{
    "projects": [
      {
        "title": "Trivial File Transfer Protocol",
        "desc": "This Java program is a TFTP implementation that acts similar to a TCP handshake, which allows packets to be sent from one computer to another. Acknowledgement packets ensures that eachpacket was sent successfully",
        "skills": [
          "UML diagrams",
          "Client/Server architecture",
          "Collaboration with two group members",
          "Local Network file transfers"
        ]
      },
      {
        "title": "Email Signature",
        "desc": "A client from Upwork requested an email signature and provided assets and a general layout. I sent prototypes of the signature to the client and made changes accordingly",
        "skills": [
          "HTML5",
          "CSS/SCSS",
          "Client Collaboration"
        ]
      },
      {
        "title": "Message Board",
        "desc": "A full stack (MERN) site using Express/Node to create a REST API in order to communicate with the MongoDB           database. This allows users to register, create new messages, and view other people&apos;s messages. It&apos;s currently a local host project and a minimum viable product.",
        "skills": [
          "Node.js",
          "React",
          "Redux",
          "Express",
          "MongoDB",
          "SPA",
          "REST API",
          "Authentication/Authorization with JWT",
          "CI with Travis CI"
        ]
      },
      {
        "title": "Project Management System",
        "desc": "This Spring project relies heavily on mocking agile development to mimic what working on projects would be like. I created features on new branches and pull requests were required to add to the production branch.  Every new feature required unit tests as a bare minimum. I conducted  biweekly stand-ups to view the project&apos;s status and to consider future features",
        "skills": [
          "Spring",
          "HTML",
          "CSS",
          "Travis CI",
          "Replicating Agile Practices"
        ]
      },
      {
        "title": "JavaScript Calculator",
        "desc": "I created a calculator using JavaScript to manipulate the DOM which consisted of adding the many buttons and their repective event listeners. I also performed the calculations using closures in order to allow for chaining and styling was done with CSS.",
        "skills": [
          "Jasmine testing",
          "JS/ES6",
          "Webpack",
          "CSS/Grid/Flexbox"
        ]
      }
    ]
  }