{
    "intro":"Hi Jaymee. I see you managed to find this. First and foremost HAPPY BIRTHDAY BEAUTIFUL LOVE OF MY LIFE :). I'm sorry I didn't get you anything for your brithday and I felt bad, so instead I figured I'd go ahead and give you this as I love writing you letters and you love reading them. Of course this is not as good as a handwritten letter but it will have to do for now! Where do I even begin. Jaymee Maaghop, I love you so extremely much and even though you keep telling me that I should be looking for someone else cause you're 'apparently not hot and not worthy of me' I shall never! You're all I want. You're smart, funny, loving, caring, beautiful and all I could ask for in a woman! I am so extremely happy that our paths crossed in this dimension and that we have spent this much time together already! If we're able to be this in love with eachother without the physical component, just imagine how amplified the feelings are going to be when we are together! To me it sounds incredible and I can't wait for it!",
    "closing":"I really really really wish that I could have seen you before your birthday, or even surprised you and came down on your birthday. If I made it out for the trip that we had planned I 1000% would have done something like this to you heheehhehe. Potentially get some free food and yaknow, get revenge for the time when we were literally talking about how we both don't enjoy it when there's a scene made, but yet 2 seconds later.... ahahah thankfully she was chill and it was a little thing. It was cute. I LOVE YOU SO SO SO SO MUCH JAYMEE MAAGHOP!",
    "message1":"HAPPY BIRTHDAY JAYMEE!!!!!!!",
    "message2":"I can't say it enough, but thank you for everything that you do. You send me packages, give me op op food recipes, give me tons of loving and I just can't get enough of you! You make me so extremely happy and I am such a lucky man being able to find someone as sexy and fun as yourself! I love watching spending time with you whether that be through watching movies, playing games, talking, running, going on walks and sleeping together! It's all a great time and I love that I am able to fall asleep next to you and (sometimes) wake up next to you when disc decides to not troll!"
}